a, b = map(int, input().split())
print("сумма:",a+b)
# Задача 2: Сложение двух чисел
# Напишите программу, которая запрашивает у пользователя два числа и выводит их сумму.
# Пример:
# Ввод: 3, 5
# Вывод: Сумма: 8