a, b = map(int, input().split())
m=a//b
n=a%b
print("Целое деление",m,"Остаток:",n)# Задача 9: Деление с остатком
# Напишите программу, которая запрашивает у пользователя два числа и выводит результат их целого деления и остаток.
# Пример:
# Ввод: 9, 4
# Вывод: Целое деление: 2, Остаток: 1